# Exam_02_1
Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы.
В конце ответа не должно быть переноса на новую строку.
```C
#include <stdio.h>
int main (void)
{
	int x = 0;

	scanf ("%d", x);
	printf("%05d", x);
	return 0;
}
```
| Входные данные | Результат работы |
| 0 | 00000 |
| 1 | 00001 |
| -10 | -0010 |
| 666666 | 666666 |
