# Exam_02_02

Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. В конце ответа не должно быть переноса на новую строку.
```C
#include <stdio.h>
int main (void)
{
	int x = -21;

	scanf ("%d", x);
	printf("%03d", x);

	return 0;
}
```

| Входные данные | Результат работы |
| 0 | 00000 |
| 1 | 00001 |
| -12 | -0012 |
| 55555 | 55555 |
